[
  {
    "name": "Blind",
    "level": "Sierra 117",
    "difficulty": "Normal",
    "location": "At the first Convenant shuttle drop (Phantom), there is a cliff overlooking a bottomless water pit; check the cliff's edge for a rock outcrop with this skull. ",
    "video": "m4lgi42ruOk"
  },
  {
    "name": "Iron",
    "level": "Sierra 117",
    "difficulty": "Normal",
    "location": "Once you make it to the Sarge in the cell with a bunch of other marines, go outside and hop on to the roof. Do this before you free the Sarge and his troops. From the roof jump to the pipes to get on the ledge. Follow the ledge left, going around two corners where you will find the skull. ",
    "video": "4KSBYdV9_rY"
  },
  {
    "name": "Black Eye",
    "level": "Crow's Nest",
    "difficulty": "Normal",
    "location": "At the beginning of the level walk up the ramp to the higher level, heading to the door. Now turn around and jump on top of the racks. From the top of the racks, jump to the red metal scaffolding then to the ventilation where the skull is on, at the end.",
    "video": "JhnfUHspR1I"
  },
  {
    "name": "Grunt Birthday Party",
    "level": "Crow's Nest",
    "difficulty": "Normal",
    "location": "While on the your way to the barracks, after clearing a room full of brutes, you end up falling down a hole onto a pipe. there will be little flyers that attack. Drop down at the end of the pipe and quickly hold back as fast as you can. You will land on a ledge just under the pipe, where a little room is hidden with the skull in side it. This is a rather safe place to kill those foes from above. ",
    "video": "MxWU-cZshBg"
  },
  {
    "name": "Tough Luck",
    "level": "Tsavo Highway",
    "difficulty": "Normal",
    "location": "After the first blue vehicle barrier you have to blow up, walk to the other end of the tunnel. To your left is large pipeline, you need to get on the grass below there. Follow the left wall on the grassy area until you reach a pillar. The pillar connects to a ledge the is fascend to the cliff wall. Jump to the most left ledge, and walk all the way to its end. At the end turn left and you should see the skull sitting on a rock, jump to it and pick up the skull. ",
    "video": "aQzMO7SWbvw"
  },
  {
    "name": "Catch",
    "level": "The Storm",
    "difficulty": "Normal",
    "location": "After you've made it back outside and are able to ride the warthogs, look straight across from you exit, you will see a round building, the skull sits on the roof. Kill all the enemies, but DO NOT DESTROY the wraith in the corner on the upper level, otherwise the skull will disappear. Drive a warthog around back of the building and try to jump from the top of it to the roof. If you can't make it to the top, try to land a Ghost on top of it or grenade jump from the warthog, but use caution. Also take care, as the Wraith will fire from the Plasma Canon at you. Once on top of the building, snag the skull and get out of there. Method 2: On Co-Op have a person in a ghost distract the remaining wraith while the other drives to the front of the building where there is a pile of dirt on which you can park and easily crouch jump to the top of the building and grab the skull",
    "video": "6mbXdRiIZLM"
  },
  {
    "name": "Fog",
    "level": "Floodgate",
    "difficulty": "Normal",
    "location": "As you begin, back towards the buildings where the flood just crashed, you will hear a marine yell “There! Over There!” near a ramp, just before all the buildings, Do not go any further. Around the ramp is a checkpoint. As the marine is yelling, keep your eyes peeled for a flood jumping from the roof top to the right across to a roof top on the left. That flood has in its hands the Fog skull. You must kill it before it completes its jump. you have to time it perfect, because the skull will become unreachable if it lands on top of the buildings. If you miss or kill it too early or late, just revert to saved. The check point should be just before the flood makes its jump.",
    "video": "HwtDtm9XWPQ"
  },
  {
    "name": "Famine",
    "level": "The Ark",
    "difficulty": "Normal",
    "location": "First, find and hang onto a deployable shield, then find the correct area. At the first man made underpass just after a wrecked phantom, where 2 ghost driving grunts are attacking you is where the skull is located. Kill off the grunts. Now sort of continue on the path you were already heading. You will notice a large rock formation almost touching one end of the underpass. Climb on top of the rock and then onto the structure. Go to the end pillar, you will see a hole where there appears to be a ledge you can walk on, the skull is on that ledge and you need to make it on there. If you found a deployable shield, here is where you deploy it, jump on top of it and then jump into the hole. There are 2 other ways of doing this, one is to grenade jump. The other way is to stack the 2 Ghost vehicles on top of each other, or use a Chopper. Put them just where you would put your shield and jump from the top of the vehicle to the ledge. This will take considerably more time to complete",
    "video": "tfTndyNneRQ"
  },
  {
    "name": "Cowbell",
    "level": "The Ark",
    "difficulty": "Normal",
    "location": "After defeating the Scarab, grab a Grav Lift from the Garage building in the center. Head up the ramp into the big building and continue through the first few rooms, once you start going down some glass ramps with a purple partition dividing the first and second parts of the hallway. just after the purple pillar will be a series of rooms stacked on top of each other that you can walk under. The skull is on the top level. Continue walking to get the Checkpoint. Now back up and toss down the Grav Lift on the upper slop of the hall. Try and make it land near the bottom of the ramp, but still on the ramp, close to the fourth little green dot from the top. Run and jump, and with the assistance of the Grav Lift aim for the top level. If your Grav Lift explodes before you can make it into the room, just open the door to the next room at the bottom of the ramp and let your foes kill you. ",
    "video": "vmUH103hSKc"
  },
  {
    "name": "Thunderstorm",
    "level": "The Covenant",
    "difficulty": "Normal",
    "location": "After you shut down the first tower and can fly the hornet. Before you fly to the tower Sarge couldn't shut down, fly to the tower second tower (the one the Arbiter and the Elites shut down). Land at the bottom and go up first ramp. From here, turn and walk down the platform leading to a look out that hangs over the ocean. The skull is at the end of this walkway. ",
    "video": "Aw7Puvdx-8k"
  },
  {
    "name": "IWHBYD",
    "level": "The Covenant",
    "difficulty": "Normal",
    "location": "This skull is nicely hidden. Firstly, after the Arbiter defeats the Prophet of Truth, start heading back to the elevator, killing all the flood on the way. Once you've reached the elevator turn around and here is where the fun begins. You must jump through the Halo rings in a specific order, It does not matter which way you jump through that rings, as long as you don't touch it after you jump through it. 4-6-5-4-5-3-4 1 being the ring closest to the elevator, 7 being the ring closest to the Prophet of Truth's corpse. When you jump through the final ring, they should light up in a sequential pattern like a Christmas Tree. After the rings light up, follow them back to where the body of the Prophet of Truth lies. The skull will be waiting for you on the edge of the bridge. ",
    "video": "LLOm7olquhk"
  },
  {
    "name": "Tilt",
    "level": "Cortana",
    "difficulty": "Normal",
    "location": "There will be a room you enter into through one of those weird door things that opens when you near them. To the right of the entrance should be a dead elite with a sword next to its body. You'll likely want to first defeat the flood in the room so you don't die in the process of getting the skull, it can get frustrating. Look for a purple ledge with a small rounded part on its end, it looks kind of like a control panel. Jump on top of that rounded part and look up, jump to the rocks above it. From there, turn left, where another set of rocks are sticking out of the wall, jump up there. Now do a 180° turn and jump up again and jump onto the rocks now across from you. Careful, you might hit your head on this part and fall all the way to the bottom. From on top of this rock, jump onto the part that sticks out like a bridge and follow it to the top of the structure that covers the room below, the skull sits on top",
    "video": "Z63ciUJKco4"
  },
  {
    "name": "Mythic",
    "level": "Halo",
    "difficulty": "Normal",
    "location": "From the start of the mission, hug the right wall, following it up a hill and into a cave. Continue to hug the wall, passing the boulder. Keep right and at the end of the path is the skull. ",
    "video": "3PFP6q9lYGA"
  }
]
