[
  {
    "id": 1,
    "level": "Winter Contingency",
    "location": "Starting from the point where the civilian truck \"Spade\" can be used. In the second structure encountered by crossing the bridge, the structure on the right of the circular area is a group of dead civilians, one of them with the Data Pad on his side.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Hey, You Dropped This"
  },
  {
    "id": 10,
    "level": "Winter Contingency",
    "location": "A cloaked SpecOps Elite will spawn near the site of the distress beacon, fleeing from the area to the bottom of the first hill. It holds a data pad, which can be accessed if the Elite is killed.",
    "isLegendary": true,
    "video": "kT_JTVX9yrk",
    "game": "Halo: Reach",
    "achievement": "Unreliable Narrator"
  },
  {
    "id": 2,
    "level": "ONI: Sword Base",
    "location": "The data pad is located inside the facility's atrium, on the third floor. It is inside the same room as the BOB, underneath the staircase leading to the fourth floor. That place is where the Shotgun spawn in the multiplayer map Sword Base.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Read Halsey's Journal"
  },
  {
    "id": 11,
    "level": "ONI: Sword Base",
    "location": "Go to Farragut Station. Head to the building where the switch to the Comms relay is located, and on the back of the building is a broken extension to the cliff next to it (the cliff is where the players start in the level \"The Package\"). Jump to the cliff, and head east. The data pad is located around the area.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "What Does It All Mean?"
  },
  {
    "id": 3,
    "level": "Nightfall",
    "location": "Starting from the beginning of the level. Stick to the right side of the wall and walk towards the next part of the level. One should enter a small cave, and along the left wall of the cave and between two rocks and shrubs lies a data pad.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Meeting of the (Artificial) Minds"
  },
  {
    "id": 12,
    "level": "Nightfall",
    "location": "Play until the Reach militia troopers are found fighting Covenant troops. Continue on through the valley, and jump on the rocks on the right of the entrance. Make way to the data pad by jumping to other rocks, across a large gap requiring Sprint, and eventually, just before reaching the rock bridge (where Jun and the troopers will take cover from the Phantom), a data pad can be found on the right side of the valley. This will take some time to find.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "Unsolved Mysteries"
  },
  {
    "id": 4,
    "level": "Tip of the Spear",
    "location": "The data pad is inside the BXR Mining facility, the area below where the player is instructed to kill a Sangheili Zealot. Jump down the hole and get to the room where the Plasma Launcher is located. On the opposite side of the room is 3 UNSC crates and rack behind it. The Data pad is on the second shelf of the rack.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Rampant Speculation"
  },
  {
    "id": 13,
    "level": "Tip of the Spear",
    "location": "When in the area where the second Tyrant AA cannon is, jump on to the columns to get to the destroyed bridge. Beside the damaged Warthog and dead UNSC Army troopers, a data pad can be found.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "Meddling and Madness"
  },
  {
    "id": 5,
    "level": "Long Night of Solace",
    "location": "The data pad is inside the Sabre Launch facility. On the left of the control room (where the player can see a hologram of the Covenant corvette), is a small elevated area lit by red lights. The data pad can be found in front of the control desk, beside a human corpse.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Minority Report"
  },
  {
    "id": 14,
    "level": "Long Night of Solace",
    "location": "Get to the where the Sabre is in the launch facility. Just before the climbing the stairs outlined yellow, look to one's left, and a platform can be seen. Jump on to the platform, and use the gray light scaffolding to get to the grey diagonal pillar. Continue through the pillar and one should reach the end of it, where the data pad lies.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "The Answer is Simple"
  },
  {
    "id": 6,
    "level": "Exodus",
    "location": "Starting from where the player will acquire a Jetpack. Before entering the interior of another building (where the player will be told to fly up to the highest floor), there is a construction platform on top of the doorway. The data pad is located on the construction platform's walkway, beside a civilian corpse.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Info Dump"
  },
  {
    "id": 15,
    "level": "Exodus",
    "location": "Reach the area where the Jackal snipers and Brute Captains are encountered (The large plaza across from Traxus Tower and the sniper rifle). To the right directly across from the executive landing pad, you will see some pipes leading to a series of zig-zagging struts. Fly over to the struts from the east side of the plaza (you can only very nearly reach the struts from the landing pad) and climb up them until you reach the pair of vent units at the top. The datapad is sitting on top of the right one.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "Of Patience and Partiality"
  },
  {
    "id": 7,
    "level": "New Alexandria",
    "location": "Head to the Olympic Tower (known as the ONI HQ in-game). There are seven buildings in a circle around the tower, six of which have flat spaces which hold Shade turrets during the final sequence of the level. The seventh one has a large wedge shape taking up most of the roof; the data pad is on the north side (the side with five vent units on it) of this roof next to a door.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Paper Trail"
  },
  {
    "id": 16,
    "level": "New Alexandria",
    "location": "Start from the beginning of level. Turn around and head southeast. The first building encountered has the data pad. Fly to the bottom, and a message will appear on the HUD, which reads \"TOO LOW!!! PULL UP!!!\". This is the altitude the data pad is on. Fly closer to the building, and the area that is sticking in has a data pad on the left at the end of the rail.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "Curious Composition"
  },
  {
    "id": 8,
    "level": "The Package",
    "location": "After entering the main atrium of Sword Base, the data pad is located at the left of the door the player needs to activate to trigger the cutscene.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Terminal Conditions"
  },
  {
    "id": 17,
    "level": "The Package",
    "location": "Get a Jetpack outside Dr. Halsey's lab. Fly towards the southeast of the Wolf Spider Turret labelled \"C\", and eventually reaching a cliff face. On the right side, there is a small cliff, and a data pad is on it.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "Silent Shepherds"
  },
  {
    "id": 9,
    "level": "The Pillar of Autumn",
    "location": "Get past the area where the multiplayer map \"Boneyard\" takes place. After entering the interior again, the player will go pass two dead troopers. Stick to the right side of the corridor, and there should be two windows looking at two room on the right side of the corridor. The second room, which can be accessed by breaking the window and jumping into it, on its further left corner, has a pile of cardboard boxes and a table, which is where the data pad is on.",
    "isLegendary": false,
    "video": "7jc42DtzTGQ",
    "game": "Halo: Reach",
    "achievement": "Digital Destinies"
  },
  {
    "id": 18,
    "level": "The Pillar of Autumn",
    "location": "Get to the area used as the multiplayer map \"Boneyard\". Outside the garage (where the Scorpion spawns in Invasion, on the roof of the building, there is a data pad.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "Assembled the Majority"
  },
  {
    "id": 19,
    "level": "Lone Wolf",
    "location": "Get to where the dead Spartan and his/her sniper rifle lie on metal planks. There is a big pipe beside the metal planks. The data pad is located inside the pipe. Even though there is a metal fence between the player and the data pad, the data pad can still be accessed.",
    "isLegendary": true,
    "video": "fD7KnxpCbgw",
    "game": "Halo: Reach",
    "achievement": "Yes No You Decide"
  }
]