[{"name": "Iron", "level": "The Pillar of Autumn", "difficulty": "Any", "location": "This skull is located in the very beginning of the level, at the back of the Cryo deck. If facing away from the observation platform (where Sam is killed) it is on the left side of the room, behind a stack of crates that are behind the targeting lights. ", "video": "gSYsY5OqqBA", "game": "Halo 1"}, {"name": "Mythic", "level": "Halo", "difficulty": "Any", "location": " After defeating the first Covenant wave, walk directly towards the waterfall from the escape pod. It is behind the large boulder on the right in the water.", "video": "zG1F9lEdmD8", "game": "Halo 1"}, {"name": "Boom", "level": "Halo", "difficulty": "Any", "location": "Before driving the Warthog into the underground Forerunner facility, look straight up to see a series of pipes. Walk along the cliff edge and jump to the pipe mesh. The skull is sitting on the hill above the entrance.", "video": "jLkZggDCu10", "game": "Halo 1"}, {"name": "Foreign", "level": "Truth and Reconciliation", "difficulty": "Any", "location": "The bottom floor of the hanger, in the hallway where the Hunters emerge from (door to the right of the exit to the upper floors)", "video": "JJ5qylr_Xbg", "game": "Halo 1"}, {"name": "Famine", "level": "The Silent Cartographer", "difficulty": "Any", "location": "When you land on the beach, head in the clockwise direction around the item. The skull is situated on top of a hill with a winding path up the back of it (the hill which the Pelican crashes next to). The skull is in between three bushes.", "video": "hf3W9NRtS7w", "game": "Halo 1"}, {"name": "Bandana", "level": "The Silent Cartographer", "difficulty": "Any", "location": "At the end of the tunnel, on the ceiling in the security console chamber. A grenade or rocket jump is usually necessary. An alternative method is for the first player to crouch on the window strip in the tunnel below the skull, then having a second player kill himself and subsequently respawn on top of the first player. The skull would then be instantly acquired.", "video": "oMlJA8_E1vk", "game": "Halo 1"}, {"name": "Fog", "level": "Assault on the Control Room", "difficulty": "Any", "location": "After crossing the first bridge and taking the elevator down to the ground floor, the skull will be on a raised platform in the center of this room and will be surrounded by fog. It will require a grenade jump to reach it.", "video": "yLFmTcCpvlE", "game": "Halo 1"}, {"name": "Malfunction", "level": "Assault on the Control Room", "difficulty": "Any", "location": "When you enter the tunnel and you come to the large room with a gorge, you will notice pipes that stick out of the gorge in the middle on both sides. The skull is on one of the pipes sticking out of the gorge's walls.", "video": "GsE3ZvNKCxQ", "game": "Halo 1"}, {"name": "Recession", "level": "343 Guilty Spark", "difficulty": "Any", "location": "Located to the left of the Facility in a little drop behind a shade turret. When you cross the fallen tree, you'll see a shade turret blow up and assault rifle fire coming from the structure. Instead of going inside, immediately go to the left and keep against the back wall. You'll come to a turret with a small drop behind it. Slide down the drop carefully and the skull will be waiting for you at the bottom. ", "video": "1KDlZWGDYng", "game": "Halo 1"}, {"name": "Black Eye", "level": "The Library", "difficulty": "Any", "location": "In the back of one of the vents before entering the Index chamber for the first time. (Warning: Grenade jump necessary.) On the first floor at the beginning of the level, you will notice squarish openings in the ceiling that the flood use to enter the level. Before entering the round, yellow room, find the vent closest to that door and do a grenade jump into it.", "video": "Qpj7Umztq_c", "game": "Halo 1"}, {"name": "Eye Patch", "level": "The Library", "difficulty": "Any", "location": "Behind the Index on the final platform. Instead of running onto the platform to grab the Index, go around while remaining as far from the Index as possible. The skull will be waiting on the ground right behind it. ", "video": "Fi_8Yk9W0m8", "game": "Halo 1"}, {"name": "Pinata", "level": "Two Betrayals", "difficulty": "Any", "location": "After the final fight with two Wraiths and capturing the last Banshee, fly it past the third generator room back to where you emerged from the chasm tunnel. The skull is sitting on the top of the underground entrance.", "video": "mNI1yYpi5kU", "game": "Halo 1"}, {"name": "Grunt Birthday Party", "level": "The Maw", "difficulty": "Any", "location": "On the bridge where Foehammer is shot down, use your Warthog to get up on one of the railings where Foehammer goes down at the end of the mission.", "video": "-pnSmZq3GJ4", "game": "Halo 1"}, {"name": "Anger", "level": "Gravemind", "difficulty": "Legendary", "location": "After you save both groups of Marines, continue until you reach the first outdoor area with dirt and vegetation. Take a right as you enter this room and run up to the wall past the Gravity Lift that leads up to the sniper point. Get on top of the wall by going up the dirt mound on your left. Follow the wall and an invisible Gunner Grunt will spawn wielding a Fuel Rod Gun.", "video": "cuMhiwB79eQ", "game": "Halo 2"}, {"name": "Assassins", "level": "Regret", "difficulty": "Legendary", "location": "Immediately after the gondola ride following the battle with the Hunters, there will be a building with two turrets on it. Enter the building and turn to your right. There will be a box, jump on it. From there jump to the adjacent light fixture, then to the ledge. The ledge leads to the area with the two turrets. <br />Once there, Grenade Jump to get onto the roof area. Then, using Crouch Jumps and/or Grenade Jumps, follow the right side perimeter of the building. Once you have gone as far as you can go you will find a small grassy area with two Stealth Elites holding Energy Swords (one can be assassinated, the other cannot) in their \"angry stance\" and the Assassins Skull between them. ", "video": "4S5Ld5qKPAI", "game": "Halo 2"}, {"name": "Black Eye", "level": "The Great Journey", "difficulty": "Legendary", "location": "Eventually you have to escort Sergeant Johnson, who is in a Scarab, to Delta Halo's Control Room. Follow him along until you see the Control Room in front of you. Directly above the door that Johnson blows open with the Scarab is an angled beam. Land your Banshee on this beam and walk to the top of the beam. Look down and to your left and you will see a circular angled wall. Jump onto this wall and walk to the top. Walk straight along the right-hand side of this area. You will have to jump over a small beam in front of you. Continue walking straight until you come to a grassy area. Keep walking up the grassy hill and go until you come to the point where can jump onto the angled support for the tower meets the grass. Jump onto the support and walk up the support. It's a very steep climb, so jumping while you're going up the support speeds up the walk some. At the first landing you will see the Black Eye skull sitting on a glowing white panel on the floor. ", "video": "u6cpVBypBZg", "game": "Halo 2"}, {"name": "Blind", "level": "Outskirts", "difficulty": "Any", "location": "When you start the level, go through the door and kill the Grunt there. Backtrack and right above the first door you came through there is a light. Crouch Jump onto that and either Crouch Jump or Grenade Jump again (Crouch Jumping is easier), and you should be on the roof (or you can get the Sputnik Skull and only use one grenade). Look for a space between the two buildings, and go into it, at the end there should be four Fragmentation Grenades, a spotting scope, and the Skull in front of them.", "video": "7bmGDXfLcq8", "game": "Halo 2"}, {"name": "Catch", "level": "Metropolis", "difficulty": "Legendary", "location": "Right after you exit from the underground highway, you'll come to a large open-air circular area with a handful of Jackal Snipers and some Elites. The quickest way to get safely to the Skull is to get the next checkpoint by jumping into the Warthog and letting the Marine drive you to the next area. Jump out of the Warthog and backtrack to the large room, and clear the area. Or you can get your Warthog from the bridge and just run right through the platforms and the other part until you reach the place where you find the Wraiths attacking the building where the Marines are (but you don't have to fight them) and then go back and the enemies will be gone when you go back. You will see a large semi-circular beam going from one of the main platforms that goes from the ground up to the top of the two towers. Do a Grenade Jump at the bottom of this beam and walk all the way to the top. Jump over to the ledge of the left tower. Walk to the end of the ledge and you will find the Catch Skull. The Sputnik Skull may be helpful if you have trouble Grenade Jumping. ", "video": "5tk6CnNse88", "game": "Halo 2"}, {"name": "Envy", "level": "Delta Halo", "difficulty": "Legendary", "location": "Progress through Delta Halo until you come to an area with a large central structure that has a multitude of columns (the place with the many stationary shield generators). This is the area where Cortana tells you that they are all pouring out of the middle. When you first get into this area, you have to go left, and there is a ramp on the left that goes up and then back down. Get on this ramp and continue up the wall until you are on the landing where there will be (or used to be) some Plasma Turrets. Follow this landing all the way to its end, and you'll see a door that is blocked off by a large stone. Jump on top of the stone, and jump again to get on a thin ledge. Make sure you're up against the left wall, and Grenade Jump up to the top of the wall to your left. Once you're on this wall, you'll see that the right wall ends and there is some earth behind it. Jump onto the dirt, and follow the stone wall all the way to the top. When you're on the top of this wall, you can look down towards the center and you should see two Stealth Elites repeating their \"angry stance\" towards each other with the Envy skull between them. (Note: They will not attack you, even if you shoot at them. But if they are killed they will fire their weapons randomly before they hit the ground, which can hurt you). Another way of getting the Skull is to grenade the stone away from the door. For that, you'll need all the Fragmentation and Plasma Grenades you can carry, sometimes even more (using rocket launcher and having the Sputnik skull would be helpful). Throw each of them into the corner behind the stone. Every time a grenade explodes, the stone will move a little. You'll never get it fully out of the way, but after about eight or nine grenades, there will be enough space to go through the door. Alternatively jump on the rock and throw one Plasma Grenade in the corner behind the rock. This should move it enough so that you can drop into the crack and melee the rock until the doorway is clear. If not, throw a couple more grenades. If you do not have any grenades or rocket launcher ammo, use a Scorpion or Wraith to blast the stone away. This method leads you up a ramp and into a room open to one side where you'll find two dead Grunts along with two Energy Swords (an Easter Egg which implies that these two Grunts accidentally killed themselves with the Swords). Exit the room and you'll be on a platform above the normal area. Grenade jump towards the room you just exited, and you'll be with the Stealth Elites and the Envy Skull. ", "video": "6PFQhmb_3bk", "game": "Halo 2"}, {"name": "Famine", "level": "The Oracle", "difficulty": "Legendary", "location": "After you get off of the slowly descending elevator, you will come to a hallway where you see a handful of dead bodies. Continue into the next room, and you will be on the second floor of a room that has a lot of glass windows. When you enter this room, look to the right, and find the third pane of glass. It should be to the right of a wall that has some Flood guts splattered on it. Shoot out this window, and the windows directly across the room. If you look below you, you will see a platform that has four tall posts. On the far side of the room there is a column that is right in between the two windows on the far side of the room. Turn on your Active Camouflage, and jump to the center platform. Jump on either of the posts on the far side of the platform and jump to the column between the windows. Make another jump through the window you shot out, and make a left. Walk all the way to the end and you'll find four Elite Combat Forms convulsing on the floor, with the Famine Skull in the middle of them. Sometimes, the Combat Form nearest to the battlefield stands up, but it does not attack. ", "video": "eLjDjJKRB84", "game": "Halo 2"}, {"name": "Ghost", "level": "Uprising", "difficulty": "Legendary", "location": "Immediately after the armory room that is full of Covenant and human weapons, there is an L shaped room. Grenade Jump, using a Ghost, up to the rafters of this room, and you will find the Skull over a doorway. Or, if you are playing co-op, get a box from the weapon room, and have one player stand on the box, then have the other player stand on the first player's head, have player two Crouch Jump on to the ledge and grab the skull. ", "video": "R9OOfRPaNpU", "game": "Halo 2"}, {"name": "Grunt Birthday Party", "level": "The Arbiter", "difficulty": "Legendary", "location": "The very first time you get a Banshee, fly down. Below you is a large beam-like structure (not to be confused with the one directly below you that turns and goes vertical) running from the arm of the station you just came out of to one exactly like it on the side opposite. Below this structure are three cylinders hanging down, with cylinders of light shooting out of the bottom(and the sides). They look like they are what keep the station afloat. If this explanation is too vague, they are the absolute lowest parts of the station. Now go to the middle engine and land on the top part of it. This and the other engines connect to the large structure mentioned earlier. The tops of the engines come up to meet the structure at an angle, where this angle is under the connecting structure and coming up to meet it, there is a place to walk (like being under a bridge). Under one side you will see the six Heretic Grunts dancing in a circle around the Skull. If you want to see the effects immediately, headshot one of the Grunts (the others won't react in any way), and his head will explode!", "video": "L0HtdmZ2Rpk", "game": "Halo 2"}, {"name": "IWHBYD", "level": "Outskirts", "difficulty": "Legendary", "location": "The skull can be found on the level Outskirts when playing on Legendary. This skull has a one in seven chance of spawning (referenced by the \"1\" and \"7\" posters in the room containing the skull) when the game loads the Jackal snipers in the alley after the clearing where Johnson is picked up in the pelican. You may skip the entirety of the encounters up to the sniper alley by using the rooftops. The following guide is a fast route to the skull with safety checkpoints. It is strongly advised that you activate the permanent invisibility glitch for this. From the beginning of Outskirts, run into the first hallway and then look overhead. You will see two lights on either side of the hallway. Jump on to one of them, and then crouch jump up to the higher platform. From there turn around and run along the ledge to the right of the alleyway below. Across from it, you will see another platform. Jump to it, then Grenade Jump or double jump onto yet another higher level. From there, look left and you will see a nearby rooftop, jump to it; go to the right and head down that alley, where you'll be able to jump onto the higher rooftop. Continue to the other side of the rooftop and drop down to the street. Turn right and head toward the open area, where you can hide from the Jackals' fire behind the large truck. Once you hear that the Jackals have been killed by your allies, you can head towards the ramp ahead, but DO NOT go past the top of the ramp. Wait for the checkpoint if it hasn't happened already, then save and quit the game. This checkpoint is before the Jackal snipers in the alley are spawned, which is when the game calculates the random chance of whether the skull spawns or not. This is the checkpoint you will reload if the skull does not spawn. Unfortunately, the game automatically checkpoints a little bit after you enter the alley as well, locking in the \"dice roll\" of the skull spawn. It is important that this checkpoint is skipped, which you can do by constantly meleeing as you run through this next part. As long as you are meleeing, the game will not save a checkpoint. If it does checkpoint, you can exit the game entirely without saving (turning off the console) and reload your saved checkpoint, or kill yourself five times quickly to revert to the pre-alley checkpoint. Head through the alley, and you should see a dumpster to your right. Jump onto the dumpster and onto the nearby roof. Jump onto the pipes attactched to the wall, onto the platform, and then leap to the roof across the alley. Head diagonally forward and right onto the roof just past bridge-like structure and turn left. You should see a balcony across the alley with a doorway. Stop meleeing now. Enter this doorway and look at the ground to the right. Wait about ten seconds. A checkpoint will occur, and the skull may or not appear at the same time as the checkpoint. If there is no skull, reload the pre-alley checkpoint, either by killing yourself five times or by quitting the game without saving, and try again. If you want to save the Skull, (in case you fail in the fight with the Elites) you should exit the room and proceed to get another checkpoint. Save and quit. Restart and go back to room with the Skull. It will always be there. When you grab the Skull, you'll be transported into the alley. You will have only a Plasma Pistol, and must fight off seven waves of Ultra Elites (wave one starting with one Elite, wave two with two Elites, and so on). ", "video": "NKUgg_1Chjc", "game": "Halo 2"}, {"name": "Iron", "level": "High Charity", "difficulty": "Legendary", "location": "When you enter the final (the second) large Gravity Lift (do not confuse with smaller ones throughout the level), look up. A Skull will pass through you extremely quickly so you must start holding X a bit before you actually pass it to grab hold of it. ", "video": "qZYbNggY0OY", "game": "Halo 2"}, {"name": "Mythic", "level": "Sacred Icon", "difficulty": "Legendary", "location": "There is a semi outdoor area which has the same type of area right next to it. There is an Enforcer in front of each one. Go past this area and down the piston and you'll be in a very dark and dank Flood infested area. There's a stack of six or seven boxes as you enter the room. Use them to jump up to the landing above. There are a handful of alcoves on your right hand side. The Skull is in the third alcove, floating above a dead human Flood. ", "video": "0Ev3AScGy1c", "game": "Halo 2"}, {"name": "Sputnik", "level": "Quarantine Zone", "difficulty": "Legendary", "location": "This is probably the easiest Skull to obtain next to the Blind Skull and That's Just Wrong Skull. At the start of the level, look directly behind you for an Elite. Right behind the Elite is a tunnel (hard to miss). Go through the tunnel and continue walking straight until you pass a bridge, which is to your right. Beyond the bridge there is a narrow ledge jutting out of the cliff face ahead. Jump onto this. Hug the wall (Just enough room for you to walk) until you get to the end of the cliff, and you will see the Sputnik Skull floating in the air. ", "video": "r_zBlmviVeE", "game": "Halo 2"}, {"name": "That's Just…Wrong", "level": "The Armory", "difficulty": "Legendary", "location": "At the beginning of the level, after you power your shields for the first time, Sergeant Johnson shows up on an elevator. Wait in the room until Johnson starts berating you, telling you to get into the elevator. You MUST wait for him to say \"Would it help if I said please?\" (this takes approximately four minutes and forty seconds). Once he says this, get in the elevator, and go up to the tram. Get on the tram, and face towards the INSIDE of the building. Press up against the glass doors towards the inside of the building. You should hold X down, and you should pick up the Skull. It's on a stack of crates, near the end of the tram ride.", "video": "XBU3EQg_p7c", "game": "Halo 2"}, {"name": "Thunderstorm", "level": "Cairo Station", "difficulty": "Legendary", "location": "In the large room after the armory, you need to use a Crouch Jump to get onto a light fixture on the right wall (right of the room when you enter) and then jump from there onto the higher area. There is a series of diagonal beams. Walk up one near to the end of it and use it to Crouch Jump onto one of the rails. You can fall between the rails, so be careful. Once on the rail, walk down it until you can jump onto the highest platform. Then melee the trashcan away from the wall a few times, the Skull is right behind it.", "video": "vahV1MSRbHk", "game": "Halo 2"}, {"name": "Blind", "level": "Sierra 117", "difficulty": "Normal", "location": "At the first Convenant shuttle drop (Phantom), there is a cliff overlooking a bottomless water pit; check the cliff's edge for a rock outcrop with this skull. ", "video": "m4lgi42ruOk", "game": "Halo 3"}, {"name": "Iron", "level": "Sierra 117", "difficulty": "Normal", "location": "Once you make it to the Sarge in the cell with a bunch of other marines, go outside and hop on to the roof. Do this before you free the Sarge and his troops. From the roof jump to the pipes to get on the ledge. Follow the ledge left, going around two corners where you will find the skull. ", "video": "4KSBYdV9_rY", "game": "Halo 3"}, {"name": "Black Eye", "level": "Crow's Nest", "difficulty": "Normal", "location": "At the beginning of the level walk up the ramp to the higher level, heading to the door. Now turn around and jump on top of the racks. From the top of the racks, jump to the red metal scaffolding then to the ventilation where the skull is on, at the end.", "video": "JhnfUHspR1I", "game": "Halo 3"}, {"name": "Grunt Birthday Party", "level": "Crow's Nest", "difficulty": "Normal", "location": "While on the your way to the barracks, after clearing a room full of brutes, you end up falling down a hole onto a pipe. there will be little flyers that attack. Drop down at the end of the pipe and quickly hold back as fast as you can. You will land on a ledge just under the pipe, where a little room is hidden with the skull in side it. This is a rather safe place to kill those foes from above. ", "video": "MxWU-cZshBg", "game": "Halo 3"}, {"name": "Tough Luck", "level": "Tsavo Highway", "difficulty": "Normal", "location": "After the first blue vehicle barrier you have to blow up, walk to the other end of the tunnel. To your left is large pipeline, you need to get on the grass below there. Follow the left wall on the grassy area until you reach a pillar. The pillar connects to a ledge the is fascend to the cliff wall. Jump to the most left ledge, and walk all the way to its end. At the end turn left and you should see the skull sitting on a rock, jump to it and pick up the skull. ", "video": "aQzMO7SWbvw", "game": "Halo 3"}, {"name": "Catch", "level": "The Storm", "difficulty": "Normal", "location": "After you've made it back outside and are able to ride the warthogs, look straight across from you exit, you will see a round building, the skull sits on the roof. Kill all the enemies, but DO NOT DESTROY the wraith in the corner on the upper level, otherwise the skull will disappear. Drive a warthog around back of the building and try to jump from the top of it to the roof. If you can't make it to the top, try to land a Ghost on top of it or grenade jump from the warthog, but use caution. Also take care, as the Wraith will fire from the Plasma Canon at you. Once on top of the building, snag the skull and get out of there. Method 2: On Co-Op have a person in a ghost distract the remaining wraith while the other drives to the front of the building where there is a pile of dirt on which you can park and easily crouch jump to the top of the building and grab the skull", "video": "6mbXdRiIZLM", "game": "Halo 3"}, {"name": "Fog", "level": "Floodgate", "difficulty": "Normal", "location": "As you begin, back towards the buildings where the flood just crashed, you will hear a marine yell “There! Over There!” near a ramp, just before all the buildings, Do not go any further. Around the ramp is a checkpoint. As the marine is yelling, keep your eyes peeled for a flood jumping from the roof top to the right across to a roof top on the left. That flood has in its hands the Fog skull. You must kill it before it completes its jump. you have to time it perfect, because the skull will become unreachable if it lands on top of the buildings. If you miss or kill it too early or late, just revert to saved. The check point should be just before the flood makes its jump.", "video": "HwtDtm9XWPQ", "game": "Halo 3"}, {"name": "Famine", "level": "The Ark", "difficulty": "Normal", "location": "First, find and hang onto a deployable shield, then find the correct area. At the first man made underpass just after a wrecked phantom, where 2 ghost driving grunts are attacking you is where the skull is located. Kill off the grunts. Now sort of continue on the path you were already heading. You will notice a large rock formation almost touching one end of the underpass. Climb on top of the rock and then onto the structure. Go to the end pillar, you will see a hole where there appears to be a ledge you can walk on, the skull is on that ledge and you need to make it on there. If you found a deployable shield, here is where you deploy it, jump on top of it and then jump into the hole. There are 2 other ways of doing this, one is to grenade jump. The other way is to stack the 2 Ghost vehicles on top of each other, or use a Chopper. Put them just where you would put your shield and jump from the top of the vehicle to the ledge. This will take considerably more time to complete", "video": "tfTndyNneRQ", "game": "Halo 3"}, {"name": "Cowbell", "level": "The Ark", "difficulty": "Normal", "location": "After defeating the Scarab, grab a Grav Lift from the Garage building in the center. Head up the ramp into the big building and continue through the first few rooms, once you start going down some glass ramps with a purple partition dividing the first and second parts of the hallway. just after the purple pillar will be a series of rooms stacked on top of each other that you can walk under. The skull is on the top level. Continue walking to get the Checkpoint. Now back up and toss down the Grav Lift on the upper slop of the hall. Try and make it land near the bottom of the ramp, but still on the ramp, close to the fourth little green dot from the top. Run and jump, and with the assistance of the Grav Lift aim for the top level. If your Grav Lift explodes before you can make it into the room, just open the door to the next room at the bottom of the ramp and let your foes kill you. ", "video": "vmUH103hSKc", "game": "Halo 3"}, {"name": "Thunderstorm", "level": "The Covenant", "difficulty": "Normal", "location": "After you shut down the first tower and can fly the hornet. Before you fly to the tower Sarge couldn't shut down, fly to the tower second tower (the one the Arbiter and the Elites shut down). Land at the bottom and go up first ramp. From here, turn and walk down the platform leading to a look out that hangs over the ocean. The skull is at the end of this walkway. ", "video": "Aw7Puvdx-8k", "game": "Halo 3"}, {"name": "IWHBYD", "level": "The Covenant", "difficulty": "Normal", "location": "This skull is nicely hidden. Firstly, after the Arbiter defeats the Prophet of Truth, start heading back to the elevator, killing all the flood on the way. Once you've reached the elevator turn around and here is where the fun begins. You must jump through the Halo rings in a specific order, It does not matter which way you jump through that rings, as long as you don't touch it after you jump through it. 4-6-5-4-5-3-4 1 being the ring closest to the elevator, 7 being the ring closest to the Prophet of Truth's corpse. When you jump through the final ring, they should light up in a sequential pattern like a Christmas Tree. After the rings light up, follow them back to where the body of the Prophet of Truth lies. The skull will be waiting for you on the edge of the bridge. ", "video": "LLOm7olquhk", "game": "Halo 3"}, {"name": "Tilt", "level": "Cortana", "difficulty": "Normal", "location": "There will be a room you enter into through one of those weird door things that opens when you near them. To the right of the entrance should be a dead elite with a sword next to its body. You'll likely want to first defeat the flood in the room so you don't die in the process of getting the skull, it can get frustrating. Look for a purple ledge with a small rounded part on its end, it looks kind of like a control panel. Jump on top of that rounded part and look up, jump to the rocks above it. From there, turn left, where another set of rocks are sticking out of the wall, jump up there. Now do a 180° turn and jump up again and jump onto the rocks now across from you. Careful, you might hit your head on this part and fall all the way to the bottom. From on top of this rock, jump onto the part that sticks out like a bridge and follow it to the top of the structure that covers the room below, the skull sits on top", "video": "Z63ciUJKco4", "game": "Halo 3"}, {"name": "Mythic", "level": "Halo", "difficulty": "Normal", "location": "From the start of the mission, hug the right wall, following it up a hill and into a cave. Continue to hug the wall, passing the boulder. Keep right and at the end of the path is the skull. ", "video": "3PFP6q9lYGA", "game": "Halo 3"}]