[{"id": 1, "level": "The Pillar of Autumn", "location": "The terminal is one of the computer consoles located on the left side of the Autumn's bridge. All of the console's screens flash \"INCOMING MESSAGE\" in red, and a crewman is standing beside it instead of manning the console", "video": "svySAukA4Lo", "game": "halo1"}, {"id": 2, "level": "Halo", "location": "Near the start of the tunnel, you will come across a ledge leading to the next section. If you carry on the route rather than make the jump, you will drive past a small alcove. The second terminal is located at the far end of this alcove. ", "video": "ndpJfvwSwMA", "game": "halo1"}, {"id": 3, "level": "The Truth and Reconciliation", "location": "The third terminal is located within the vessel's bridge, in the middle of the front holographic displays. The section is indicated with a red color that stands out from the rest. ", "video": "4nCEgO5RS9A", "game": "halo1"}, {"id": 4, "level": "The Silent Cartographer", "location": "The fourth terminal is located against the Marathon-symbol-shaped structure near the center of the island where the first Hunter pair is fought, on the circular part and beneath the \"bridge\"", "video": "S27kQ2Byrlo", "game": "halo1"}, {"id": 5, "level": "Assault on the Control Room", "location": "The fifth terminal is located at the bottom of a pit in front of the Control Room structure at the end of the level. The terminal is on the ground, under the base of a large metal strut that runs diagonally down the front building.", "video": "snJzuyc7rgw", "game": "halo1"}, {"id": 6, "level": "343 Guilty Spark", "location": "The sixth terminal is found while riding the third elevator that will allow you to escape the underground facility. You'll find the terminal above the doorway you came out of. It can be reached by activating the elevator, then timing it correctly and jumping off onto the platform below (there is only one possible attempt due to the lack of elevator controls on the top floor). ", "video": "ITkbPlFiZ7k", "game": "halo1"}, {"id": 7, "level": "The Library", "location": "The seventh terminal is located on the Library's third floor. You will eventually come to the index chamber - a room with a large circular room, with the Index platform above it. Go either right or left and jump over the low barriers until you get to the opposite side. The terminal flashes yellow, and can be clearly seen across the chasm.", "video": "CK9IS0u5JVI", "game": "halo1"}, {"id": 8, "level": "Two Betrayals", "location": "The eighth terminal is in the control room at the level's very beginning. walk around the circular platform and the terminal can be found directly across from the central console.", "video": "9J-TpVmQkuo", "game": "halo1"}, {"id": 9, "level": "Keyes", "location": "The ninth terminal can be found after the player find Keyes absorbed into the Proto-Gravemind. Eliminate nearby Covenant and Flood forces, then search the sunken crevices to the side of the raised platform. The terminal is a red holographic panel, and will be on one the right crevice's wall.", "video": "-MLN_OInslA", "game": "halo1"}, {"id": 10, "level": "The Maw", "location": "The tenth terminal in the game can be found in the Cryo Bay's second floor, where Sentinels are fighting a large Flood force. The terminal is a computer screen on the wall, similar to the first terminal. ", "video": "1hs2NcG-sU8", "game": "halo1"}, {"id": 1, "level": "Cairo Station", "location": "The terminal is one of the computer consoles located in Cairo Station's Armory A-01, on the wall to the left of the doors leading into Commons B-01. The console's screen flashes \"INCOMING MESSAGE\" in red.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 2, "level": "Outskirts", "location": "The terminal is a computer screen located on ground floor of the small building in the beach area before entering the highway tunnels. The console's screen flashes \"INCOMING MESSAGE\" in red.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 3, "level": "Metropolis", "location": "The terminal is a computer screen located near the stairs at ground floor of the Marine command post, after being greeted by Perez. The console's screen flashes \"INCOMING MESSAGE\" in red.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 4, "level": "The Arbiter", "location": "The terminal is a Forerunner terminal in the room bisected by two Forerunner gas canister conveyors, at the top of the ramp in the far right of the room.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 5, "level": "The Oracle", "location": "The terminal is a Forerunner terminal in the large room after exiting the large lift, behind the wall opposite to the exit door.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 6, "level": "Delta Halo", "location": "The terminal is a Covenant terminal in the room of the Forerunner structure contains the first hologram of Prophet of Regret and the switch which extends the bridge.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 7, "level": "Regret", "location": "The terminal is a Forerunner terminal in the large submerged room with Kig-Yar Snipers, Yanme'e, Sangheili Honor Guardsmen, and a pair of Mgalekgolo. The terminal is on the upper level, on the pillar behind Prophet of Regret's hologram.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 8, "level": "Sacred Icon", "location": "The terminal is a Covenant terminal in the room with the final piston of the level. The room is easily identified by the fact that it is completely devoid of combat; the only Flood in the room are dead. The terminal is behind a wall on the right side of the room.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 9, "level": "Quarantine Zone", "location": "The terminal is a Forerunner terminal in the first large room in the crashed Sentinel manufacturing facility. It is on the lower level, beneath the platform on the far side of the room.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 10, "level": "Gravemind", "location": "The terminal is a Covenant terminal in the first Valley of Tears. At the top of the cliff on the far side of the valley, near the exit door, on the wall behind where a Kig-Yar Sniper spawns, it can be found on the wall.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 11, "level": "Uprising", "location": "The terminal is a Forerunner terminal in the first area of the chapter \"Fight Club\" after the waterfall, before crossing the stone bridge into the armory room with both human and Covenantweapons. The terminal can be found on the wall inside the second alcove.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 12, "level": "High Charity", "location": "The terminal is a Covenant terminal to the left of the door after entering the Inner Sanctum.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 13, "level": "The Great Journey", "location": "The terminal is a Forerunner terminal in back of one of the jail cells of the Bastion of the Brutes. It is in the center right cell on the upper level.", "video": "4TTKFwym_aw", "game": "halo2"}, {"id": 1, "level": "Requiem", "location": "In the level Requiem, after entering the terminus tower, one will enter a room where the structures hanging from the ceiling will retract into the walls on the side. At the far end of the room is a staircase that leads to the elevator which is the objective. The terminal is located under the staircase.", "video": "v1t54Yc8tms", "game": "halo4"}, {"id": 2, "level": "Forerunner", "location": "In the level Forerunner, during the journey to the first pylon, the player will reach a symmetrical platform. After clearing the Prometheans in that area, John's HUD will be distorted, which prompts him to ask, \"What's that distortion?\" Under the door leading to the next area is the Terminal.", "video": "Lxj1n_z2log", "game": "halo4"}, {"id": 3, "level": "Infinity", "location": " On the level Infinity, after meeting Lasky and Palmer and being told to find an LZ, look behind the Chief and the terminal is seen at the end of the corridor.", "video": "Zmmzhcsnsaw", "game": "halo4"}, {"id": 4, "level": "Reclaimer", "location": "During the level Reclaimer after the Librarian cutscene. Exit the Librarian's chamber like you normally would, but instead of heading straight for the elevator, take a detour down the corridor on the right. The Terminal should be in plain view.", "video": "Y_mGmqAnVEE", "game": "halo4"}, {"id": 5, "level": "Shutdown", "location": "In the level Shutdown in the third spire. Get to the central platform with multiple light bridges. Cross the light bridge to the left of the bridge you would normally cross to reach your objective. This leads to a platform guarded by Jackals. The Terminal is located behind the platform's central column.", "video": "AD2wFtwlkgw", "game": "halo4"}, {"id": 6, "level": "Composer", "location": "During the level Composer, outside the station. The Terminal is located within a cluster of rocks under the Atrium.", "video": "SRA7hWhChQc", "game": "halo4"}, {"id": 7, "level": "Midnight", "location": " During the level Midnight, shortly after boarding the Mantle's Approach. Get to the third room with enemies in it. There should be no Knights here. The Terminal is located in this room's central structure.", "video": "VQ96F9snhfs", "game": "halo4"}]